14790897/ESP32-Vlog-Camera/src/app_httpd.cpp
    <div class="container">
        <!-- 视频流卡片 -->
        <div class="card">
            <div class="card-header">
                <div class="card-title">实时预览</div>
                <div id="status" class="status status-stopped">准备就绪</div>
            </div>
            <div class="stream-container">
                <img src="/stream" alt="Camera Stream" id="stream">
                <div class="stream-overlay" id="fps-display">30 FPS</div>
            </div>
            <div class="stats" id="stats">
                <div class="stat-item">分辨率: <span id="resolution">HD</span></div>
                <div class="stat-item">质量: <span id="quality">高</span></div>
            </div>
        </div>

        <!-- 录制控制卡片 -->
        <div class="card">
            <div class="card-header">
                <div class="card-title">录制控制</div>
            </div>
            <div class="controls">
                <button id="startBtn" class="btn btn-success">开始录制</button>
                <button id="stopBtn" class="btn btn-danger">停止录制</button>
            </div>

            <!-- 录制信息显示区 -->
            <div id="recording-info" class="recording-info" style="display: none; margin-top: 20px; padding-top: 15px; border-top: 1px solid #eee;">
                <h3 style="font-size: 1.1rem; margin-bottom: 10px;">当前录制信息</h3>
                <div class="recording-stats">
                    <div class="stat-row">
                        <span class="stat-label">文件名：</span>
                        <span id="rec-filename" class="stat-value">-</span>
                    </div>
                    <div class="stat-row">
                        <span class="stat-label">录制时长：</span>
                        <span id="rec-duration" class="stat-value">00:00:00</span>
                    </div>
                    <div class="stat-row">
                        <span class="stat-label">文件大小：</span>
                        <span id="rec-size" class="stat-value">0 KB</span>
                    </div>
                    <div class="stat-row">
                        <span class="stat-label">帧数：</span>
                        <span id="rec-frames" class="stat-value">0</span>
                    </div>
                    <div class="stat-row">
                        <span class="stat-label">实时帧率：</span>
                        <span id="rec-fps" class="stat-value">0 FPS</span>
                    </div>
                </div>
            </div>
        </div>

        <!-- 设置卡片 -->
        <div class="card">
            <div class="card-header">
                <div class="card-title">相机设置</div>
            </div>
            <div class="settings-grid">
                <div class="setting-item">
                    <div class="setting-label">
                        <span>帧率 (FPS)</span>
                        <span class="setting-value" id="fps-value">30</span>
                    </div>
                    <input type="range" min="5" max="60" value="30" class="slider" id="fps-slider">
                </div>

                <div class="setting-item">
                    <div class="setting-label">
                        <span>陀螺仪数据</span>
                    </div>
                    <label class="toggle-switch">
                        <input type="checkbox" id="mpu-toggle">
                        <span class="toggle-slider"></span>
                    </label>
                </div>
            </div>
        </div>
    </div>

    <div id="notification" class="notification"></div>

    <script>
        // DOM元素
        const statusEl = document.getElementById('status');
        const startBtn = document.getElementById('startBtn');
        const stopBtn = document.getElementById('stopBtn');
        const fpsSlider = document.getElementById('fps-slider');
        const fpsValue = document.getElementById('fps-value');
        const fpsDisplay = document.getElementById('fps-display');
        const mpuToggle = document.getElementById('mpu-toggle');
        const notificationEl = document.getElementById('notification');

        // 录制信息元素
        const recordingInfoEl = document.getElementById('recording-info');
        const recFilenameEl = document.getElementById('rec-filename');
        const recDurationEl = document.getElementById('rec-duration');
        const recSizeEl = document.getElementById('rec-size');
        const recFramesEl = document.getElementById('rec-frames');
        const recFpsEl = document.getElementById('rec-fps');

        // 显示通知
        function showNotification(message, duration = 3000) {
            notificationEl.textContent = message;
            notificationEl.classList.add('show');

            setTimeout(() => {
                notificationEl.classList.remove('show');
            }, duration);
        }

        // 格式化时间为 HH:MM:SS
        function formatTime(seconds) {
            const hrs = Math.floor(seconds / 3600);
            const mins = Math.floor((seconds % 3600) / 60);
            const secs = Math.floor(seconds % 60);
            return `${hrs.toString().padStart(2, '0')}:${mins.toString().padStart(2, '0')}:${secs.toString().padStart(2, '0')}`;
        }

        // 获取录制统计信息
        async function fetchRecordingStats() {
            try {
                const response = await fetch('/recording_stats');
                const data = await response.json();

                if (data.recording) {
                    // 显示录制信息区域
                    recordingInfoEl.style.display = 'block';

                    // 更新各项统计信息
                    recFilenameEl.textContent = data.filename || '-';
                    recDurationEl.textContent = formatTime(data.duration);
                    recSizeEl.textContent = data.size;
                    recFramesEl.textContent = data.frames;
                    recFpsEl.textContent = `${data.fps.toFixed(1)} FPS`;
                } else {
                    // 隐藏录制信息区域
                    recordingInfoEl.style.display = 'none';
                }
            } catch (error) {
                console.error('Error fetching recording stats:', error);
            }
        }

        // 更新录制状态
        async function updateStatus() {
            try {
                const response = await fetch('/record');
                const statusText = await response.text();

                if (statusText.includes('Recording')) {
                    statusEl.textContent = '正在录制';
                    statusEl.className = 'status status-recording';
                    startBtn.disabled = true;
                    stopBtn.disabled = false;

                    // 获取录制统计信息
                    await fetchRecordingStats();
                } else {
                    statusEl.textContent = '准备就绪';
                    statusEl.className = 'status status-stopped';
                    startBtn.disabled = false;
                    stopBtn.disabled = true;
                    recordingInfoEl.style.display = 'none';
                }
            } catch (error) {
                console.error('Error checking status:', error);
            }
        }

