14790897/ESP32-Vlog-Camera/src/app_httpd.cpp
    if (httpd_req_get_url_query_str(req, query, sizeof(query)) == ESP_OK) {
        if (httpd_query_key_value(query, "value", value, sizeof(value)) == ESP_OK) {
            int fps = atoi(value);
            if (fps > 0) {
                setTargetFPS(fps);
                changed = true;
            }
        }
    }

    httpd_resp_set_type(req, "text/plain");
    if (changed) {
        httpd_resp_sendstr(req, "FPS updated");
    } else {
        char resp[64];
        snprintf(resp, sizeof(resp), "Current FPS: %d", targetFPS);
        httpd_resp_sendstr(req, resp);
    }

    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    return ESP_OK;
}

// Handler for getting recording statistics
static esp_err_t recording_stats_handler(httpd_req_t *req)
{
    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

    char json_response[256];

    if (isRecording) {
        // Calculate recording duration in seconds
        unsigned long duration = (millis() - recordingStartTime) / 1000;

        // Format file size to human-readable format
        char size_str[32];
        if (currentRecordingSize < 1024) {
            snprintf(size_str, sizeof(size_str), "%u B", (unsigned int)currentRecordingSize);
        } else if (currentRecordingSize < 1024 * 1024) {
            snprintf(size_str, sizeof(size_str), "%.1f KB", currentRecordingSize / 1024.0);
        } else {
            snprintf(size_str, sizeof(size_str), "%.2f MB", currentRecordingSize / (1024.0 * 1024.0));
        }

        // Extract filename from path
        const char* filename = strrchr(currentRecordingPath.c_str(), '/');
        if (filename) {
            filename++; // Skip the slash
        } else {
            filename = currentRecordingPath.c_str();
        }

        // Create JSON response
        snprintf(json_response, sizeof(json_response),
                 "{\"recording\":true,\"duration\":%lu,\"frames\":%d,\"fps\":%.1f,\"size\":\"%s\",\"filename\":\"%s\"}",
                 duration, currentFrameCount, currentFps, size_str, filename);
    } else {
        // Not recording
        snprintf(json_response, sizeof(json_response), "{\"recording\":false}");
    }

    return httpd_resp_sendstr(req, json_response);
}


void startCameraServer()
{
    // Redirect ESP-IDF log output to Arduino Serial
    redirect_esp_log_to_serial();

    // NTP time sync initialization
    if (!sntp_enabled()) {
        sntp_setoperatingmode(SNTP_OPMODE_POLL);
        sntp_setservername(0, (char*)"ntp.aliyun.com");
        sntp_setservername(1, (char*)"pool.ntp.org");
        sntp_init();
    }

    // Wait for time to be set (max 5s)
    time_t now = 0;
    struct tm timeinfo = { 0 };
    int retry = 0;
    const int retry_count = 10;
    while (timeinfo.tm_year < (2016 - 1900) && ++retry < retry_count) {
        Serial.printf("[I] Waiting for system time to be set... (%d/%d)\n", retry, retry_count);
        vTaskDelay(500 / portTICK_PERIOD_MS);
        time(&now);
        localtime_r(&now, &timeinfo);
    }

    // Initialize SD Card
    if (!initSDCard())
    {
        Serial.printf("[E] Failed to initialize SD card - recording will be disabled\n");
    }

    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    config.max_uri_handlers = 16;

    // Add index handler for the root path
    httpd_uri_t index_uri = {
        .uri       = "/",
        .method    = HTTP_GET,
        .handler   = index_handler,
        .user_ctx  = NULL
    };

    httpd_uri_t xclk_uri = {
        .uri = "/xclk",
        .method = HTTP_GET,
        .handler = xclk_handler,
        .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
        ,
        .is_websocket = true,
        .handle_ws_control_frames = false,
        .supported_subprotocol = NULL
#endif
    };

    httpd_uri_t record_uri = {
        .uri = "/record",
        .method = HTTP_GET,
        .handler = record_handler,
        .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
        ,
        .is_websocket = false, // Changed to false since this is not a websocket endpoint
        .handle_ws_control_frames = false,
        .supported_subprotocol = NULL
#endif
    };

    httpd_uri_t mpu_toggle_uri = {
        .uri = "/mpu_toggle",
        .method = HTTP_GET,
        .handler = mpu_toggle_handler,
        .user_ctx = NULL
    };

    httpd_uri_t fps_uri = {
        .uri = "/fps",
        .method = HTTP_GET,
        .handler = fps_handler,
        .user_ctx = NULL
    };

    httpd_uri_t stats_uri = {
        .uri = "/recording_stats",
        .method = HTTP_GET,
        .handler = recording_stats_handler,
        .user_ctx = NULL
    };

    ra_filter_init(&ra_filter, 20);

    // Set initial FPS
    setTargetFPS(30); // Default to 30 FPS

    Serial.printf("[I] Starting web server on port: '%d'\n", config.server_port);
    if (httpd_start(&camera_httpd, &config) == ESP_OK)
    {
        httpd_register_uri_handler(camera_httpd, &index_uri);  // Register index handler
        httpd_register_uri_handler(camera_httpd, &xclk_uri);
        httpd_register_uri_handler(camera_httpd, &record_uri); // Register record handler
        httpd_register_uri_handler(camera_httpd, &mpu_toggle_uri); // Register MPU control handler
        httpd_register_uri_handler(camera_httpd, &fps_uri); // Register FPS control handler
        httpd_register_uri_handler(camera_httpd, &stats_uri); // Register recording stats handler
        Serial.printf("[I] Camera server started successfully\n");
    } else {
        Serial.printf("[E] Failed to start camera server\n");
    }

}

// Function to set the target FPS
void setTargetFPS(int fps) {
    if (fps < 1) fps = 1; // Prevent division by zero
    if (fps > 60) fps = 60; // Cap at 60 FPS to be reasonable

    targetFPS = fps;
    minFrameTimeMs = 1000 / targetFPS;
    Serial.printf("[I] Target FPS set to %d (frame interval: %d ms)\n", targetFPS, minFrameTimeMs);
}

void setupLedFlash(int pin)
{
#if CONFIG_LED_ILLUMINATOR_ENABLED
    // Modern PWM configuration for ESP32-S3
    // Using LEDC channel 8 with 10-bit resolution and 5kHz frequency
    ledcSetup(8, 5000, 10); // channel 8, 5kHz, 10-bit resolution (0-1023)
    ledcAttachPin(pin, 8);  // attach the pin to channel 8
    // Initialize with LED off
    ledcWrite(8, 0);
#else
    Serial.printf("[I] LED flash is disabled -> CONFIG_LED_ILLUMINATOR_ENABLED = 0\n");
#endif
}